In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
dframe = pd.read_csv('pivot.csv')
dframe

   Region Product Month  Sales
0    East       A   Jan    100
1    East       A   Jan    100
2    East       A   Feb    150
3    East       B   Jan    300
4    East       B   Feb    200
5    West       A   Jan    150
6    West       A   Feb    225
7    West       B   Jan    200
8    West       B   Feb    250
9   North       A   Jan    175
10  North       A   Feb    255
11  North       B   Jan    150

In [5]:
#1. Create a pivot table that shows the total sales by region and product.
pivot_table = pd.dframe(dframe, columns=['Region','Product','Month','Sales'])
pivot_table

AttributeError: module 'pandas' has no attribute 'dframe'